Public Member Functions | List of all members
ACAPI::MEP::v1::ICalculationResultColumn Class Referenceabstract
MEP Element Manager
Formatting for calculated values. More...
#include <MEPGraphCalculationInterface.hpp>
 Inheritance diagram for ACAPI::MEP::v1::ICalculationResultColumn:
 Public Member Functions
 virtual  | ~ICalculationResultColumn ()
Destructor.
virtual GS::UniString  | GetId () const =0
Globally unique ID for this column.
virtual GS::Int32  | GetDefaultWidth () const =0
Starting width of the column to present the calculated data.
virtual GS::UniString  | GetTitle () const =0
Header title for this column without the unit.
virtual std::optional< GS::UniString >  | GetUnitToDisplay (MeasurementSystem system) const =0
Unit to display in the column's header title.
virtual GS::UniString  | FormatValueToDisplayText (const std::any &value, MeasurementSystem system) const =0
Formats the value to a displayable text.
virtual bool  | IsLess (const std::any &value1, const std::any &value2) const =0
True if value1 < value2.
virtual bool  | IsEqual (const std::any &value1, const std::any &value2) const =0
True if value1 = value2.
Detailed Description
Formatting for calculated values.
Since
Archicad 28
Member Function Documentation
◆ FormatValueToDisplayText()
 virtual GS::UniString ACAPI::MEP::v1::ICalculationResultColumn::FormatValueToDisplayText  |  ( |  const std::any &  |  value,
|  MeasurementSystem  |  system
) |   |  const
pure virtual
Formats the value to a displayable text.
Parameters
value | The value to format into a displayable text
system | The measurement system in which the displayed text is interpeted
Returns
The displayable text
◆ GetDefaultWidth()
 virtual GS::Int32 ACAPI::MEP::v1::ICalculationResultColumn::GetDefaultWidth  |  ( |   | ) |   const
pure virtual
Starting width of the column to present the calculated data.
Returns
The starting width of this column
◆ GetId()
 virtual GS::UniString ACAPI::MEP::v1::ICalculationResultColumn::GetId  |  ( |   | ) |   const
pure virtual
Globally unique ID for this column.
Returns
The identifier for this column
Remarks
This is only a technical ID, it won't be displayed anywhere on the GUI.
◆ GetTitle()
 virtual GS::UniString ACAPI::MEP::v1::ICalculationResultColumn::GetTitle  |  ( |   | ) |   const
pure virtual
Header title for this column without the unit.
Returns
The displayable header title for this column
Remarks
This is what will be displayed on the GUI (should be localized if possible). The actual header text will be a combination of this and the unit in the following format: "<title> [<unit>]"
◆ GetUnitToDisplay()
 virtual std::optional< GS::UniString > ACAPI::MEP::v1::ICalculationResultColumn::GetUnitToDisplay  |  ( |  MeasurementSystem  |  system | ) |   const
pure virtual
Unit to display in the column's header title.
Returns
The displayable header title for this column
Parameters
system | The selected measurement system
Remarks
This is what will be displayed on the GUI (should be localized if possible).
◆ IsEqual()
 virtual bool ACAPI::MEP::v1::ICalculationResultColumn::IsEqual  |  ( |  const std::any &  |  value1,
|  const std::any &  |  value2
) |   |  const
pure virtual
True if value1 = value2.
Parameters
value1 | first value that is checked if it equals to the second value
value2 | second value
Returns
True if value1 equals to value2
Implemented in ACAPI::MEP::v1::TypedCalculationResultColumn< T >.
◆ IsLess()
 virtual bool ACAPI::MEP::v1::ICalculationResultColumn::IsLess  |  ( |  const std::any &  |  value1,
|  const std::any &  |  value2
) |   |  const
pure virtual
True if value1 < value2.
Parameters
value1 | first value that is checked if it is less than the second value
value2 | second value
Returns
True if value1 is less than value2
Implemented in ACAPI::MEP::v1::TypedCalculationResultColumn< T >.